---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.CreatePartsWithInvalidSystem
source: html/47a9fb33-6f6e-48e6-7669-cc55eccf50b0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.CreatePartsWithInvalidSystem Property

Parts were not created because the element does not have a valid system.

## Syntax (C#)
```csharp
public static FailureDefinitionId CreatePartsWithInvalidSystem { get; }
```